app/Controllers/Apadrinhar.php

SELECT *
FROM `apadrinhar`
---
    public function index()
    {
        $pets = $this->apadrinharModel->findAll();

SELECT *
FROM `apadrinhar`
---
    public function list(){
        $pets = $this->apadrinharModel->findAll();

SELECT *
FROM `apadrinhar`
WHERE `apadrinhar`.`id` = '21'
DELETE FROM `apadrinhar`
WHERE `id` IN ('21')
---
    public function delete($id){
        $pet = $this->apadrinharModel->find($id);

        if (!$pet) {
            return redirect()->to('/apadrinhar/listar')->with('erro', 'Pet não encontrado.');
        }

        if (!empty($pet['imagem'])) {
            $caminhoImagem = FCPATH . 'uploads/apadrinhar/' . $pet['imagem'];
            if (file_exists($caminhoImagem)) {
                unlink($caminhoImagem);
            }
        }

        if($this->apadrinharModel->delete($id)){