app/Controllers/DoacaoDash.php

    public function Listar2()
    {
        $doacao_model = new DoacaoModel();
        $animais = $doacao_model->findAll();
---
SELECT *
FROM `doacao`

    public function cadastrar()
    {
        $dados = $this->request
                        ->getVar();

        $doacao_model = new DoacaoModel();

        $doacao_model->insert($dados);
---
INSERT INTO `doacao` (`nome`, `especie`, `idade`, `castrado`, `vacinado`, `descricao`) VALUES ('dog', 'vira lata', '2', 'Sim', 'Sim', 'cachorro')