app/Controllers/Galeria.php

SELECT *
FROM `galeria`
---
    public function index()
    {
        $posts = $this->galeriaModel->findAll();

SELECT *
FROM `galeria`
---
    public function list()
    {
        $posts = $this->galeriaModel->findAll();

SELECT *
FROM `galeria`
WHERE `galeria`.`id` = '3'
DELETE FROM `galeria`
WHERE `id` IN ('3')
---
    public function delete($id)
    {
        $post = $this->galeriaModel->find($id);

        if (!$post) {
            return redirect()->to('/galeria/list')->with('erro', 'Post não encontrado.');
        }

        if (!empty($post['imagem'])) {
            $caminhoImagem = FCPATH . 'uploads/galeria/' . $post['imagem'];
            if (file_exists($caminhoImagem)) {
                unlink($caminhoImagem);
            }
        }

        if ($this->galeriaModel->delete($id)) {