app/Controllers/Loja.php

SELECT *
FROM `produtos`
---
    public function index()
    {
        $produtos = $this->produtoModel->findAll();

SELECT *
FROM `produtos`
---
    public function listar()
    {
        $produtos = $this->produtoModel->findAll();

SELECT *
FROM `produtos`
WHERE `produtos`.`id` = '3'
DELETE FROM `produtos`
WHERE `id` IN ('3')
---
    public function delete($id)
    {
        $produto = $this->produtoModel->find($id);

        if (!$produto) {
            return redirect()->to('/loja/listar')->with('erro', 'Produto não encontrado.');
        }

        if (!empty($produto['imagem'])) {
            $caminhoImagem = FCPATH . 'uploads/produtos/' . $produto['imagem'];
            if (file_exists($caminhoImagem)) {
                unlink($caminhoImagem);
            }
        }

        $this->produtoModel->delete($id);