app/Controllers/Resgates.php

    public function index()
    {
        $resgates = $this->resgatesModel->findAll();
---
SELECT *
FROM `resgates`

    public function delete($id)
    {
        $resgate = $this->resgatesModel->find($id);

        if (!$resgate) {
            return redirect()->to('/resgates/listar')->with('erro', 'Resgate não encontrado.');
        }

        if (!empty($resgate['foto_antes'])) {
            $caminho = FCPATH . 'uploads/resgates/' . $resgate['foto_antes'];
            if (file_exists($caminho)) unlink($caminho);
        }
        if (!empty($resgate['foto_depois'])) {
            $caminho = FCPATH . 'uploads/resgates/' . $resgate['foto_depois'];
            if (file_exists($caminho)) unlink($caminho);
        }

        if ($this->resgatesModel->delete($id)) {
---
SELECT *
FROM `resgates`
WHERE `resgates`.`id` = '2'
DELETE FROM `resgates`
WHERE `id` IN ('2')